Parts were not created because the element does not have a valid system.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId CreatePartsWithInvalidSystem { get; }
  Visual Basic
Public Shared ReadOnly Property CreatePartsWithInvalidSystem As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ CreatePartsWithInvalidSystem {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures SystemsFailures Class
  Autodesk.Revit.DB Namespace